Основные_объекты_финиш/src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Основные_объекты_финиш/src/Documents/Реализация/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	СтруктураДанныхТекущейСтроки = Элементы.Товары.ТекущиеДанные;

	ПересчетСуммыСтроки(СтруктураДанныхТекущейСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	СтруктураДанныхТекущейСтроки = Элементы.Товары.ТекущиеДанные;

	ПересчетСуммыСтроки(СтруктураДанныхТекущейСтроки);


КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)

	СтруктураДанныхТекущейСтроки = Элементы.Товары.ТекущиеДанные;

	Если СтруктураДанныхТекущейСтроки.Количество <> 0 Тогда

		СтруктураДанныхТекущейСтроки.Цена = СтруктураДанныхТекущейСтроки.Сумма / СтруктураДанныхТекущейСтроки.Количество;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)

	СтруктураДанныхТекущейСтроки = Элементы.Услуги.ТекущиеДанные;

	ПересчетСуммыСтроки(СтруктураДанныхТекущейСтроки);


КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)

	СтруктураДанныхТекущейСтроки = Элементы.Услуги.ТекущиеДанные;

	ПересчетСуммыСтроки(СтруктураДанныхТекущейСтроки);


КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)

	СтруктураДанныхТекущейСтроки = Элементы.Услуги.ТекущиеДанные;

	Если СтруктураДанныхТекущейСтроки.Количество <> 0 Тогда

		СтруктураДанныхТекущейСтроки.Цена = СтруктураДанныхТекущейСтроки.Сумма / СтруктураДанныхТекущейСтроки.Количество;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ПересчетСуммыДокумента();


КонецПроцедуры


&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)

	ПересчетСуммыДокумента();


КонецПроцедуры

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ПересчетСуммыДокумента();


КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)

	ПересчетСуммыДокумента();


КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыДокумента()

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	СтруктураДанныхТекущейСтроки = Элементы.Товары.ТекущиеДанные;

	ТоварыНоменклатураПриИзмененииНаСервере(
	СтруктураДанныхТекущейСтроки.Номенклатура, СтруктураДанныхТекущейСтроки.ЕдиницаИзмерения, Объект.Контрагент,
		СтруктураДанныхТекущейСтроки.Цена, Объект.Дата);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(СсылкаНаНоменклатуру, СсылкаНаЕдиницуИзмерения, СсылкаНаКонтрагента,
	Цена, Дата)

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.ОсновнаяЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаНоменклатуру);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	СсылкаНаЕдиницуИзмерения = ВыборкаДетальныеЗаписи.ОсновнаяЕдиницаИзмерения;

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	НашиЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.НашиЦены.СрезПоследних(&Период, Номенклатура = &Номенклатура
	|	И Контрагент = &Контрагент) КАК НашиЦеныСрезПоследних";

	Запрос.УстановитьПараметр("Период", Дата);

	Запрос.УстановитьПараметр("Контрагент", СсылкаНаКонтрагента);

	Запрос.УстановитьПараметр("Номенклатура", СсылкаНаНоменклатуру);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Цена = ВыборкаДетальныеЗаписи.Цена;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыСтроки(СтрокаТаблицы)

	СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Цена;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	ПересчетСуммСтрокТаблицИСуммыДокумента();

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	ПересчетСуммСтрокТаблицИСуммыДокумента();


КонецПроцедуры

&НаСервере
Процедура ПересчетСуммСтрокТаблицИСуммыДокумента()

//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	НашиЦеныСрезПоследних.Номенклатура,
	|	НашиЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.НашиЦены.СрезПоследних(&Период, Контрагент = &Контрагент) КАК НашиЦеныСрезПоследних";

	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);

	Запрос.УстановитьПараметр("Период", Объект.Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		СтруктураДляПоискаСтроки = Новый Структура("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);

		МассивСтрокТаблицыТовары = Объект.Товары.НайтиСтроки(СтруктураДляПоискаСтроки);

		Если МассивСтрокТаблицыТовары.Количество() > 0 Тогда

			Для Каждого ТекСтрока Из МассивСтрокТаблицыТовары Цикл

				ТекСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;

				ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;

			КонецЦикла;

		КонецЕсли;


		МассивСтрокТаблицыУслуги = Объект.Услуги.НайтиСтроки(СтруктураДляПоискаСтроки);

		Если МассивСтрокТаблицыУслуги.Количество() > 0 Тогда

			Для Каждого ТекСтрока Из МассивСтрокТаблицыУслуги Цикл

				ТекСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;

				ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;

			КонецЦикла;

		КонецЕсли;

		Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");

	КонецЦикла;

//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
